Repository: ChahatMutha/Traffic-Management-App
Catalog: lib/l10n/app_*.arb
Languages: hi, mr

source: Settings
hi: सेटिंग्स
mr: सेटिंग्ज

source: Profile
hi: प्रोफ़ाइल
mr: प्रोफाइल

# viewOrEditProfile
source: View or edit your profile
hi: अपनी प्रोफ़ाइल देखें या संपादित करें
mr: तुमची प्रोफाइल पहा किंवा संपादित करा

source: Profile tapped
hi: प्रोफ़ाइल टैप की गई
mr: प्रोफाइल टॅप केली

source: Language
hi: भाषा
mr: भाषा

# changeLanguage
source: Change application language
hi: एप्लिकेशन की भाषा बदलें
mr: अॅपची भाषा बदला

# chooseLanguage
source: Choose a language
hi: भाषा चुनें
mr: भाषा निवडा

source: Enable or disable notifications
hi: सूचनाएं चालू या बंद करें
mr: सूचना सुरू किंवा बंद करा

source: On
hi: चालू
mr: चालू

source: Off
hi: बंद
mr: बंद

source: Dark Mode
hi: डार्क मोड
mr: डार्क मोड

source: Toggle dark theme
hi: डार्क थीम टॉगल करें
mr: डार्क थीम बदला

source: Logout
hi: लॉगआउट
mr: बाहेर पडा

source: Logout tapped
hi: लॉगआउट पर टैप किया गया
mr: लॉगआउट क्लिक केले

# appTitle
source: Traffic360
hi: ट्रॅफिक360
mr: ट्राफिक३६०

# roleTitle
source: Who are you?
hi: आप कौन हैं?
mr: आपण कोण आहात?

source: User
hi: उपयोगकर्ता
mr: वापरकर्ता

source: Police
hi: पुलिस
mr: पोलीस

source: Admin
hi: व्यवस्थापक
mr: प्रशासक

# loginTitle
source: Login with OTP
hi: ओटीपी से लॉगिन करें
mr: ओटीपीने लॉगिन करा

# enterPhoneLabel
source: Enter your phone number
hi: अपना फ़ोन नंबर दर्ज करें
mr: आपला फोन नंबर टाका

source: Phone Number
hi: फ़ोन नंबर
mr: फोन नंबर

source: Send OTP
hi: ओटीपी भेजें
mr: ओटीपी पाठवा

# otpSentTo
source: OTP sent to {phone}
hi: {phone} पर ओटीपी भेजा गया
mr: {phone} वर ओटीपी पाठवला

source: Enter OTP
hi: ओटीपी दर्ज करें
mr: ओटीपी टाका

# verifyAndContinue
source: Verify & Continue
hi: सत्यापित करें और आगे बढ़ें
mr: सत्यापित करा आणि पुढे जा

# resendIn
source: Resend in {seconds} seconds
hi: {seconds} सेकंड में पुनः भेजें
mr: {seconds} सेकंदात पुन्हा पाठवा

# didNotReceiveCode
source: Didn’t receive the code?
hi: कोड नहीं मिला?
mr: कोड मिळाला नाही?

source: Resend OTP
hi: ओटीपी पुनः भेजें
mr: ओटीपी पुन्हा पाठवा

# pleaseEnterPhone
source: 📞 Please enter a phone number
hi: 📞 कृपया फ़ोन नंबर दर्ज करें
mr: 📞 कृपया फोन नंबर टाका

# otpSentSuccess
source: ✅ OTP sent successfully to {phone}
hi: ✅ {phone} पर ओटीपी सफलतापूर्वक भेजा गया
mr: ✅ {phone} वर यशस्वीरित्या ओटीपी पाठवला

# otpFailedToSend
source: ❌ Failed to send OTP: {error}
hi: ❌ ओटीपी भेजने में विफल: {error}
mr: ❌ ओटीपी पाठवण्यात अयशस्वी: {error}

# enterValidOtp
source: Enter a valid 6-digit OTP
hi: 6-अंकीय वैध ओटीपी दर्ज करें
mr: वैध 6-अंकी ओटीपी टाका

# otpVerificationFailed
source: OTP verification failed: {error}
hi: ओटीपी सत्यापन विफल: {error}
mr: ओटीपी सत्यापन अयशस्वी: {error}

source: ❌ Invalid OTP
hi: ❌ अमान्य ओटीपी
mr: ❌ अवैध ओटीपी

source: 🎉 Welcome back!
hi: 🎉 फिर से स्वागत है!
mr: 🎉 पुन्हा स्वागत आहे!

# newUserSignup
source: ℹ️ New user – proceed to signup
hi: ℹ️ नया उपयोगकर्ता – साइनअप करें
mr: ℹ️ नवीन वापरकर्ता – साइनअप करा

# policeLoginSuccess
source: ✅ Police login successful!
hi: ✅ पुलिस लॉगिन सफल!
mr: ✅ पोलीस लॉगिन यशस्वी!

source: ⏳ Waiting for approval.
hi: ⏳ अनुमोदन की प्रतीक्षा कर रहे हैं।
mr: ⏳ मान्यतेची वाट पाहत आहोत.

source: 📝 Register as police.
hi: 📝 पुलिस के रूप में पंजीकरण करें।
mr: 📝 पोलीस म्हणून नोंदणी करा.

# redirectAdminLogin
source: 🔑 Redirecting to admin login
hi: 🔑 एडमिन लॉगिन पर जा रहे हैं
mr: 🔑 अ‍ॅडमिन लॉगिनकडे वळत आहे

source: ❌ Role not found
hi: ❌ भूमिका नहीं मिली
mr: ❌ भूमिका सापडली नाही

# signup_title
source: Complete Signup
hi: साइनअप पूरा करें
mr: साइनअप पूर्ण करा

source: Full Name
hi: पूरा नाम
mr: पूर्ण नाव

source: Email
hi: ईमेल
mr: ईमेल

source: Mobile
hi: मोबाइल
mr: मोबाईल

# submit_button
source: Submit & Continue
hi: सबमिट करें और जारी रखें
mr: सबमिट करा आणि पुढे जा

# all_fields_required
source: All fields are required.
hi: सभी फ़ील्ड अनिवार्य हैं।
mr: सर्व फील्ड आवश्यक आहेत.

# session_expired
source: Session expired. Please login again.
hi: सत्र समाप्त हो गया है। कृपया फिर से लॉगिन करें।
mr: सत्र कालबाह्य झाले. कृपया पुन्हा लॉगिन करा.

source: Signup failed
hi: साइनअप विफल हुआ
mr: साइनअप अयशस्वी झाला

# greeting_morning
source: Good Morning
hi: सुप्रभात
mr: शुभ सकाळ

# greeting_afternoon
source: Good Afternoon
hi: शुभ अपराह्न
mr: शुभ दुपार

# greeting_evening
source: Good Evening
hi: शुभ संध्या
mr: शुभ संध्याकाळ

# greeting_night
source: Good Night
hi: शुभ रात्रि
mr: शुभ रात्री

# greeting_user
source: Hi! {userName}
hi: नमस्ते! {userName}
mr: हाय! {userName}

source: Notifications
hi: सूचनाएं
mr: सूचना

# menu_my_vehicles
source: My Vehicles
hi: मेरी गाड़ियाँ
mr: माझी वाहने

# menu_my_challans
source: My Challans
hi: मेरे चालान
mr: माझे चालान

# menu_pay_challan
source: Pay E-Challan
hi: ई-चालान भुगतान करें
mr: ई-चालान भरा

# menu_tow_clamp
source: Tow & Clamp
hi: टो क्लैम्प
mr: टो क्लॅम्प

# menu_grievance
source: Grievance
hi: शिकायत
mr: तक्रार

# menu_report_violation
source: Report Violation
hi: उल्लंघन की रिपोर्ट करें

# menu_traffic_alerts
source: Traffic Alerts
hi: ट्रैफिक अलर्ट्स
mr: वाहतूक इशारे

# menu_road_signs_quiz
source: Road Signs Quiz
hi: सड़क संकेत क्विज
mr: रस्ता चिन्ह क्विझ

# menu_offenses_fines
source: Offenses & Fines
hi: अपराध और जुर्माने
mr: गुन्हे आणि दंड

# menu_road_signs
source: Road Signs
hi: सड़क संकेत
mr: रस्ता चिन्ह

# menu_public_notices
source: Public Notices
hi: सार्वजनिक नोटिस
mr: सार्वजनिक सूचना

# bottom_home
source: Home
hi: होम
mr: मुख्यपृष्ठ

# bottom_contact
source: Contact
hi: संपर्क
mr: संपर्क

# bottom_settings
source: Settings
hi: सेटिंग्स
mr: सेटिंग्ज

source: My Vehicles
hi: मेरी गाड़ियाँ
mr: माझी वाहने

source: Add Vehicle
hi: गाड़ी जोड़ें
mr: वाहन जोडा

source: Vehicle Number
hi: गाड़ी नंबर

# chassisNumber
source: Chassis No: {number}
hi: चेसिस नंबर
mr: चेसिस क्रमांक: {number}

source: Upload RC Document
hi: आरसी दस्तावेज़ अपलोड करें
mr: आरसी दस्तऐवज अपलोड करा

source: RC Selected
hi: आरसी चुनी गई
mr: आरसी निवडली गेली

source: Cancel
hi: रद्द करें
mr: रद्द करा

# add
source: Add Vehicle
hi: गाड़ी जोड़ें
mr: वाहन जोडा

# allFieldsRequired
source: All fields are required.
hi: सभी फ़ील्ड आवश्यक हैं
mr: सर्व फील्ड आवश्यक आहेत

# vehicleAdded
source: Vehicle added successfully
hi: गाड़ी सफलतापूर्वक जोड़ी गई
mr: वाहन यशस्वीरित्या जोडले गेले

# uploadFailed
source: Upload failed: {error}
hi: अपलोड विफल: {error}
mr: अपलोड अयशस्वी: {error}

# deleteFailed
source: Delete failed: {error}
hi: हटाना विफल: {error}
mr: हटवणे अयशस्वी: {error}

# vehicleDeleted
source: Vehicle deleted successfully
hi: गाड़ी सफलतापूर्वक हटाई गई
mr: वाहन यशस्वीरित्या हटवले गेले

source: No vehicles found.
hi: कोई गाड़ी नहीं मिली।
mr: कोणतेही वाहन सापडले नाही.

source: View RC
hi: आरसी देखें
mr: आरसी पहा

source: Delete Vehicle
hi: गाड़ी हटाएं
mr: वाहन हटवा

# type
source: Type: {type}
hi: प्रकार: {type}
mr: प्रकार: {type}

# chassisNo
source: Chassis No: {chassis}
hi: चेसिस नंबर: {chassis}
mr: चेसिस क्रमांक: {chassis}

source: Status
hi: स्थिति: {status}
mr: स्थिती: {status}

# statusApproved
source: Approved
hi: स्वीकृत
mr: मंजूर

# statusRejected
source: Rejected
hi: अस्वीकृत
mr: नकार

# statusPending
source: Pending
hi: प्रतीक्षा में
mr: प्रलंबित

source: Back
hi: वापस
mr: मागे

source: E-Challan Dashboard
hi: ई-चालान डैशबोर्ड
mr: ई-चालान डॅशबोर्ड

source: Challan Details
hi: चालान विवरण
mr: चालान तपशील

source: No challans found.
hi: कोई चालान नहीं मिला।
mr: कोणतेही चालान आढळले नाहीत.

source: Paid
hi: भुगतान किया गया
mr: भरणा केलेले

source: Unpaid
hi: बकाया
mr: अदा न केलेले

# challanNumber
source: Challan Number: {number}
hi: चालान नंबर: {number}
mr: चालान क्रमांक: {number}

# issuedOn
source: Issued On: {date}
hi: जारी किया गया: {date}
mr: जारी दिनांक: {date}

# vehicleType
source: Type: {type}
hi: प्रकार: {type}
mr: प्रकार: {type}

source: Location: Unknown
hi: स्थान: अज्ञात
mr: स्थान: अज्ञात

source: Location: Resolving...
hi: स्थान: खोजा जा रहा है...
mr: स्थान शोधले जात आहे...

source: Location
hi: स्थान: {location}
mr: स्थान: {location}

source: Pay
hi: भुगतान करें
mr: देय द्या

source: View Receipt
hi: रसीद देखें
mr: पावती पहा

source: View Image
hi: छवि देखें
mr: प्रतिमा पहा

source: Unknown Vehicle
hi: अज्ञात वाहन
mr: अज्ञात वाहन

# notifications_title
source: Notifications
hi: सूचनाएं
mr: सूचना

# notifications_unread
source: Unread
hi: अपठित
mr: न वाचलेले

# notifications_all
source: All
hi: सभी
mr: सर्व

# notifications_empty
source: No notifications.
hi: कोई सूचना नहीं।
mr: सूचना उपलब्ध नाहीत.

# notifications_error
source: Error: {error}
hi: त्रुटि: {error}
mr: त्रुटी: {error}

# grievance_title
source: Grievance
hi: शिकायत
mr: तक्रार

# grievance_challan_title
source: Challan
hi: चालान
mr: चालान

# grievance_challan_subtitle
source: Against Challan
hi: चालान के खिलाफ
mr: चालान विरोधात

# grievance_receipt_subtitle
source: Against Receipt
hi: रसीद के खिलाफ
mr: पावती विरोधात

# grievance_receipt_title
source: Grievance Receipt
hi: रसीद शिकायत
mr: पावती तक्रार

source: Submit Grievance
hi: शिकायत दर्ज करें
mr: तक्रार सबमिट करा

source: Submitted Receipts
hi: दर्ज की गई रसीदें
mr: सबमिट केलेल्या पावत्या

source: Receipt Grievance Form
hi: रसीद शिकायत फॉर्म
mr: पावती तक्रार फॉर्म

source: Receipt No
hi: रसीद नंबर
mr: पावती क्रमांक

source: Challan No
hi: चालान नंबर
mr: चालान क्रमांक

source: Vehicle No
hi: वाहन नंबर
mr: वाहन क्रमांक

# mobile_no
source: Mobile
hi: मोबाइल नंबर
mr: मोबाईल नंबर

# wrong_vehicle_no
source: Wrong Vehicle
hi: गलत वाहन नंबर
mr: चुकीचा वाहन क्रमांक

# correct_vehicle_no
source: Correct Vehicle
hi: सही वाहन नंबर
mr: बरोबर वाहन क्रमांक

source: Chassis Last 4
hi: चेसिस के अंतिम 4 अंक
mr: चेसिसचे शेवटचे 4 अंक

source: Remarks
hi: टिप्पणी
mr: टीप

# no_grievances_yet
source: No grievance receipts submitted yet.
hi: अभी तक कोई रसीद शिकायत दर्ज नहीं की गई है।
mr: आत्तापर्यंत कोणतीही पावती तक्रार सादर केलेली नाही.

# grievance_success_message
source: Grievance Receipt submitted.
hi: रसीद शिकायत सफलतापूर्वक दर्ज की गई।
mr: पावती तक्रार यशस्वीरित्या सादर झाली.

# title_grievance_challan
source: Grievance Challan
hi: शिकायत चालान
mr: तक्रार चालान

# title_grievance_receipt
source: Grievance Receipt
hi: शिकायत रसीद
mr: तक्रार पावती

# tab_submit_grievance
source: Submit Grievance
hi: शिकायत दर्ज करें
mr: तक्रार नोंदवा

# tab_my_submissions
source: My Submissions
hi: मेरी शिकायतें
mr: माझ्या तक्रारी

# form_grievance_details
source: Grievance Details
hi: शिकायत विवरण
mr: तक्रारीचे तपशील

# form_receipt_grievance
source: Receipt Grievance Form
hi: रसीद शिकायत फॉर्म
mr: पावती तक्रार फॉर्म

# label_challan_no
source: CHALLAN NO
hi: चालान नंबर
mr: चालान क्रमांक

# label_receipt_no
source: RECEIPT NO
hi: रसीद नंबर
mr: पावती क्रमांक

# label_vehicle_no
source: VEHICLE NO
hi: वाहन नंबर
mr: वाहन क्रमांक

# label_wrong_vehicle_no
source: WRONG VEHICLE NO
hi: गलत वाहन नंबर
mr: चुकीचा वाहन क्रमांक

# label_correct_vehicle_no
source: CORRECT VEHICLE NO
hi: सही वाहन नंबर
mr: योग्य वाहन क्रमांक

# label_mobile_no
source: MOBILE NO
hi: मोबाइल नंबर
mr: मोबाईल क्रमांक

# label_chassis_last4
source: CHASSIS LAST 4
hi: चेसिस के अंतिम 4 अंक
mr: चेसिसचे शेवटचे ४ अंक

# label_email
source: EMAIL
hi: ईमेल
mr: ईमेल

# label_reason
source: REASON
hi: कारण
mr: कारण

# label_remarks
source: REMARKS
hi: टिप्पणी
mr: शेरा

# label_amount
source: AMOUNT
hi: राशि
mr: रक्कम

# button_submit_grievance
source: Submit Grievance
hi: शिकायत सबमिट करें
mr: तक्रार सबमिट करा

# snackbar_grievance_challan_submitted
source: Grievance Challan submitted.
hi: शिकायत चालान सबमिट किया गया।
mr: तक्रार चालान सबमिट करण्यात आला.

# snackbar_grievance_receipt_submitted
source: Grievance Receipt submitted.
hi: शिकायत रसीद सबमिट की गई।
mr: तक्रार पावती सबमिट करण्यात आली.

# no_grievances
source: No grievances submitted yet.
hi: कोई शिकायत सबमिट नहीं की गई है।
mr: कोणतीही तक्रार सबमिट केलेली नाही.

# no_receipts
source: No grievance receipts found.
hi: कोई शिकायत रसीद सबमिट नहीं की गई है।
mr: कोणतीही तक्रार पावती सबमिट केलेली नाही.

source: Error
hi: त्रुटि
mr: चूक

source: Report Violation
hi: उल्लंघन रिपोर्ट करें
mr: उल्लंघन अहवाल

source: Violation History
hi: उल्लंघन इतिहास
mr: उल्लंघन इतिहास

source: Report Incident
hi: घटना रिपोर्ट करें
mr: घटना अहवाल

source: Incident History
hi: घटना इतिहास
mr: घटना इतिहास

source: Challan
hi: चालान
mr: चालान

# challan_subtitle
source: Against Challan
hi: चालान के खिलाफ
mr: चालान विरोधात

source: Receipt
hi: रसीद
mr: पावती

# receipt_subtitle
source: Against Receipt
hi: रसीद के खिलाफ
mr: पावती विरोधात

# report_violation_title
source: Report Violation
hi: उल्लंघन रिपोर्ट करें
mr: उल्लंघन रिपोर्ट करें

# report_violation_note
source: Note - Please capture image and number of vehicle and evidence details to help us take appropriate action.
hi: नोट - कृपया उपयुक्त कार्रवाई के लिए वाहन की छवि और नंबर के साथ साक्ष्य विवरण कैप्चर करें।
mr: नोट - कृपया उपयुक्त कार्रवाई के लिए वाहन की छवि और नंबर के साथ साक्ष्य विवरण कैप्चर करें।

# report_violation_learn_more
source: Learn more
hi: और जानें
mr: और जानें

# dropdown_violation_type
source: Violation Type
hi: उल्लंघन प्रकार
mr: उल्लंघन प्रकार

source: Description
hi: विवरण
mr: विवरण

source: Vehicle Number
hi: वाहन नंबर
mr: वाहन क्रमांक

# upload_images_hint
source: Upload up to 3 images:
hi: अधिकतम 3 चित्र अपलोड करें:
mr: अधिकतम 3 चित्र अपलोड करें:

source: Submit
hi: जमा करें
mr: जमा करें

# error_fill_all_fields
source: Fill all fields and upload at least 1 image.
hi: सभी फ़ील्ड भरें और कम से कम 1 चित्र अपलोड करें।
mr: सभी फ़ील्ड भरें और कम से कम 1 चित्र अपलोड करें।

# success_report_submitted
source: ✅ Violation reported successfully.
hi: ✅ उल्लंघन सफलतापूर्वक रिपोर्ट किया गया।
mr: ✅ उल्लंघन सफलतापूर्वक रिपोर्ट किया गया।

# error_submission_failed
source: ❌ Submission failed. Please try again later.
hi: ❌ सबमिशन विफल रहा। कृपया बाद में पुनः प्रयास करें।
mr: ❌ सबमिशन विफल रहा। कृपया बाद में पुनः प्रयास करें।

# civilian_report_title
source: Civilian Report
hi: नागरिक रिपोर्ट
mr: नागरिक अहवाल

# menu_violation_history
source: Violation History
hi: उल्लंघन इतिहास
mr: उल्लंघन इतिहास

# menu_incident_history
source: Incident History
hi: घटना इतिहास
mr: घटना इतिहास

# offense_screen_title
source: 🚦 Offenses & Fines
hi: 🚦 अपराध और जुर्माने
mr: 🚦 गुन्हे व दंड

# offense_1_title
source: Riding without helmet by Driver (Owner)
hi: ड्राइवर (मालिक) द्वारा बिना हेलमेट के सवारी करना
mr: चालक (मालक) ने हेल्मेट न घालता वाहन चालवले

# offense_2_title
source: Riding without helmet by Pillion (Owner)
hi: पिलियन (मालिक) द्वारा बिना हेलमेट के सवारी करना
mr: पिलियन (मालक) ने हेल्मेट न घालता वाहन चालवले

# offense_3_title
source: Passenger Carrier MV without reflectors at front - white / both side - yellow & rear - red
hi: यात्री वाहनों में सामने-सफेद / दोनों तरफ-पीला और पीछे-लाल रिफ्लेक्टर नहीं
mr: प्रवासी वाहने - समोर पांढरे / दोन्ही बाजूंना पिवळे / मागे लाल परावर्तक नसणे

# offense_4_title
source: Driving without valid License
hi: मान्य ड्राइविंग लाइसेंस के बिना गाड़ी चलाना
mr: वैध लायसन्सशिवाय वाहन चालवणे

# offense_5_title
source: Driving without valid License Below 16 years
hi: 16 वर्ष से कम उम्र में बिना लाइसेंस के गाड़ी चलाना
mr: १६ वर्षाखालील व्यक्तीने लायसन्सशिवाय वाहन चालवणे

# offense_1_section
source: Sec 129/194(D) MVA
hi: धारा 129/194(D) मोटर वाहन अधिनियम
mr: कलम 129/194(D) मोटार वाहन कायदा

# offense_2_section
source: Sec 129/194(D) MVA
hi: धारा 129/194(D) मोटर वाहन अधिनियम
mr: कलम 129/194(D) मोटार वाहन कायदा

# offense_3_section
source: CMVR 104(1)(iv)/177 MVA
hi: CMVR 104(1)(iv)/177 मोटर वाहन अधिनियम
mr: CMVR 104(1)(iv)/177 मोटार वाहन कायदा

# offense_4_section
source: Sec 3/181 MVA
hi: धारा 3/181 मोटर वाहन अधिनियम
mr: कलम 3/181 मोटार वाहन कायदा

# offense_5_section
source: Sec 4/181 MVA
hi: धारा 4/181 मोटर वाहन अधिनियम
mr: कलम 4/181 मोटार वाहन कायदा

# pay_challan_title
source: Pay E-Challan
hi: ई-चालान का भुगतान करें
mr: ई-चालान भरा

source: Challan ID
hi: चालान आईडी
mr: चालान आयडी

# search_by_vehicle
source: Vehicle no
hi: वाहन नंबर
mr: वाहन क्रमांक

# search_by_challan
source: Challan no
hi: चालान नंबर
mr: चालान क्रमांक

# pay_button
source: PAY
hi: भुगतान करें
mr: भरणा करा

# payment_success
source: ✅ Payment successful! Receipt downloaded.
hi: ✅ भुगतान सफल! रसीद डाउनलोड की गई।
mr: ✅ पेमेंट यशस्वी! पावती डाउनलोड केली.

# payment_failed
source: ⚠️ Something went wrong: {error}
hi: ⚠️ कुछ गलत हो गया: {error}
mr: ⚠️ काहीतरी चुकले: {error}

# no_vehicle_found
source: ❌ Vehicle not found. Check inputs.
hi: ❌ वाहन नहीं मिला। कृपया इनपुट जांचें।
mr: ❌ वाहन सापडले नाही. कृपया तपासा.

# no_unpaid_challans
source: ✅ Vehicle found, but no unpaid challans.
hi: ✅ वाहन मिला, लेकिन कोई अवैतनिक चालान नहीं।
mr: ✅ वाहन सापडले, परंतु कोणतेही अवैतनिक चालान नाहीत.

# invalid_challan_id
source: ❌ Invalid or already paid challan ID.
hi: ❌ अवैध या पहले से भुगतान किया गया चालान ID।
mr: ❌ अवैध किंवा आधीच भरलेले चालान आयडी.

# invalid_input_vehicle
source: Please enter valid vehicle number and last 4 digits of chassis.
hi: कृपया मान्य वाहन नंबर और चेसिस के अंतिम 4 अंक दर्ज करें।
mr: कृपया योग्य वाहन क्रमांक आणि चेसिसचे शेवटचे ४ अंक द्या.

# invalid_input_challan
source: Please enter a valid challan ID.
hi: कृपया मान्य चालान ID दर्ज करें।
mr: कृपया वैध चालान आयडी द्या.

# receipt_title
source: E-Challan Receipt
hi: ई-चालान रसीद
mr: ई-चालान पावती

# receipt_challan_id
source: Challan ID: {id}
hi: चालान ID: {id}
mr: चालान आयडी: {id}

# receipt_amount
source: Amount Paid: ₹{amount}
hi: भुगतान राशि: ₹{amount}
mr: भरलेली रक्कम: ₹{amount}

# receipt_reason
source: Reason: {reason}
hi: कारण: {reason}
mr: कारण: {reason}

# receipt_status
source: Status: Paid
hi: स्थिति: भुगतान हो गया
mr: स्थिती: भरलेले

# receipt_issued_on
source: Issued On: {date}
hi: जारी दिनांक: {date}
mr: जारी केले: {date}

# receipt_thank_you
source: Thank you for your payment.
hi: आपके भुगतान के लिए धन्यवाद।
mr: तुमच्या पेमेंटबद्दल धन्यवाद.

# title_public_notices
source: Public Notices
hi: सार्वजनिक सूचनाएं
mr: सार्वजनिक सूचना

# label_read_more
source: Read More
hi: और पढ़ें
mr: अधिक वाचा

# tooltip_view_file
source: View File
hi: फ़ाइल देखें
mr: फाईल पहा

# tooltip_download_file
source: Download File
hi: फ़ाइल डाउनलोड करें
mr: फाईल डाउनलोड करा

# message_downloaded
source: Downloaded to: {filePath}
hi: {filePath} पर डाउनलोड किया गया
mr: {filePath} वर डाउनलोड केले

# message_download_failed
source: Download failed
hi: डाउनलोड विफल
mr: डाउनलोड अयशस्वी

# message_download_error
source: Download error: {error}
hi: डाउनलोड त्रुटि: {error}
mr: डाउनलोड त्रुटी: {error}

# message_permission_denied
source: Storage permission denied
hi: स्टोरेज अनुमति अस्वीकृत
mr: स्टोरेज परवानगी नाकारली

# message_could_not_open_file
source: Could not open the file
hi: फ़ाइल नहीं खोल सके
mr: फाईल उघडता आली नाही

# dialog_close
source: Close
hi: बंद करें
mr: बंद करा

source: Error loading notices.
hi: सूचनाएं लोड करने में त्रुटि।
mr: सूचना लोड करण्यात त्रुटी.

# road_signs_title
source: Road Signs
hi: सड़क संकेत
mr: रस्ता चिन्हे

source: Stop
hi: रुको
mr: थांबा

source: No Entry
hi: प्रवेश निषेध
mr: प्रवेश नाही

# no_u_turn
source: U Turn Prohibited
hi: यू टर्न निषेध
mr: यू टर्न निषिद्ध

# no_overtaking
source: Overtaking Prohibited
hi: ओवरटेकिंग निषेध
mr: ओव्हरटेकिंग निषिद्ध

source: Speed Limit
hi: गति सीमा
mr: गती मर्यादा

source: Right Hand Curve
hi: दाहिनी ओर मोड़
mr: उजव्या हाताला वळण

source: Pedestrian Crossing
hi: पैदल पार पथ
mr: पादचारी क्रॉसिंग

source: School Ahead
hi: आगे स्कूल है
mr: पुढे शाळा आहे

# no_right_turn
source: Right Turn Prohibited
hi: दायाँ मोड़ निषेध
mr: उजवे वळण निषिद्ध

source: Slippery Road
hi: फिसलन भरी सड़क
mr: घसरणारी रस्ता

source: Y - Intersection
hi: Y-जंक्शन
mr: Y-जोडणी

# narrow_bridge
source: Narrow Bridge Ahead
hi: संकीर्ण पुल आगे
mr: पुढे अरुंद पूल

source: Left Hand Curve
hi: बाईं ओर मोड़
mr: डाव्या हाताला वळण

source: Railway Crossing
hi: रेलवे क्रॉसिंग
mr: रेल्वे क्रॉसिंग

source: Roundabout
hi: राउंडअबाउट
mr: गोल वळण

source: No Horn
hi: हॉर्न निषेध
mr: हॉर्न वाजवू नका

source: Cattle Crossing
hi: पशु पार पथ
mr: जनावरांचा रस्ता

# quiz_title
source: 🚦 Road Sign Quiz
hi: 🚦 सड़क संकेत प्रश्नोत्तरी
mr: 🚦 रस्ता चिन्ह प्रश्नमंजुषा

source: Loading...
hi: लोड हो रहा है...
mr: लोड होत आहे...

# error_loading
source: Error loading quiz.
hi: प्रश्नोत्तरी लोड करने में त्रुटि।
mr: प्रश्न लोड करताना त्रुटी.

# no_questions
source: No quiz questions found.
hi: कोई प्रश्न नहीं मिले।
mr: प्रश्न उपलब्ध नाहीत.

source: 🎉 Quiz Completed!
hi: 🎉 प्रश्नोत्तरी समाप्त!
mr: 🎉 प्रश्नमंजुषा पूर्ण!

# your_score
source: Your Score: {score} / {total}
hi: आपका स्कोर: {score} / {total}
mr: तुमचा स्कोअर: {score} / {total}

source: Restart Quiz
hi: पुनः प्रयास करें
mr: पुन्हा सुरुवात करा

source: Correct
hi: ✅ सही!
mr: ✅ बरोबर!

# incorrect
source: ❌ Incorrect. Correct answer: {answer}
hi: ❌ गलत। सही उत्तर: {answer}
mr: ❌ चुकीचे. बरोबर उत्तर: {answer}

source: Explanation
hi: 📝 स्पष्टीकरण: {text}
mr: 📝 स्पष्टीकरण: {text}

source: Next
hi: अगला
mr: पुढे

# contact_title
source: Contact Us
hi: संपर्क करें
mr: संपर्क करा

# contact_help
source: Need Help or Support?
hi: मदद या सहायता चाहिए?
mr: मदतीसाठी किंवा सहाय्यासाठी?

# contact_helpline
source: Traffic Helpline
hi: ट्रैफिक हेल्पलाइन
mr: वाहतूक हेल्पलाइन

# contact_email_label
source: Email Us
hi: हमें ईमेल करें
mr: आम्हाला ईमेल करा

# contact_office_label
source: Office Address
hi: कार्यालय का पता
mr: कार्यालयाचा पत्ता

# contact_office
source: Traffic Control HQ, Mumbai Maharashtra, India
hi: ट्रैफिक कंट्रोल मुख्यालय, मुंबई महाराष्ट्र, भारत
mr: वाहतूक नियंत्रण मुख्यालय, मुंबई महाराष्ट्र, भारत

# contact_hours_label
source: Working Hours
hi: कार्य समय
mr: कामाचे तास

# contact_hours
source: Mon–Sat: 9 AM to 6 PM
hi: सोम–शनिवार: सुबह 9 बजे से शाम 6 बजे तक
mr: सोम–शनि: सकाळी 9 ते संध्याकाळी 6

# nav_home
source: Home
hi: मुखपृष्ठ
mr: मुख्यपृष्ठ

# nav_contact
source: Contact
hi: संपर्क
mr: संपर्क

# nav_settings
source: Settings
hi: सेटिंग्स
mr: सेटिंग्ज

# challan_title
source: E-Challan
hi: ई-चालान
mr: ई-चलन

source: Paid Challans
hi: भरे गए चालान
mr: भरण केलेले चलन

source: Unpaid Challans
hi: बकाया चालान
mr: बकाया चलन

# no_challans
source: No grievances found.
hi: कोई चालान नहीं मिला
mr: कोणतेही चलन सापडले नाहीत

source: Loading challans...
hi: चालान लोड हो रहे हैं...
mr: चलन लोड करत आहे...

source: Challan Details
hi: चालान विवरण
mr: चलन तपशील

# filter_all
source: All
hi: सभी
mr: सर्व

# filter_paid
source: Paid
hi: भरे गए
mr: भरण केलेले

# filter_unpaid
source: Unpaid
hi: बकाया
mr: बकाया

source: Issued On
hi: जारी करने की तिथि
mr: जारी दिनांक

source: No challans found
hi: कोई चालान नहीं मिला
mr: कोणतेही चलन सापडले नाहीत

# no_notifications
source: No notifications found
hi: कोई सूचना नहीं मिली
mr: कोणतीही सूचना सापडली नाही

source: Mark as read
hi: पढ़ा हुआ चिह्नित करें
mr: वाचले म्हणून चिन्हांकित करा

source: New Notification
hi: नई सूचना
mr: नवीन सूचना

source: Read
hi: पढ़ा गया
mr: वाचलेले

source: Unread
hi: अपढ़
mr: न वाचलेले

source: Search by
hi: खोजें
mr: शोधा

# chassis_last_4
source: Last 4 digits of Chassis No
hi: चेसिस नंबर के अंतिम 4 अंक
mr: चेसिस क्रमांकाचे शेवटचे 4 आकडे

# challan_number
source: Challan #:
hi: चालान नंबर
mr: चलन क्रमांक

source: Vehicle
hi: वाहन
mr: वाहन

source: Search
hi: खोजें
mr: शोधा

source: Enter vehicle number
hi: वाहन क्रमांक दर्ज करें
mr: वाहन क्रमांक प्रविष्ट करा

# enter_chassis_last_4
source: Enter last 4 digits of chassis
hi: चेसिस के अंतिम 4 अंक दर्ज करें
mr: चेसिसचे शेवटचे 4 आकडे प्रविष्ट करा

source: Enter challan number
hi: चालान नंबर दर्ज करें
mr: चलन क्रमांक प्रविष्ट करा

source: Violation Type
hi: उल्लंघन प्रकार
mr: उल्लंघन प्रकार

# upload_photo
source: Upload Photo (optional)
hi: फ़ोटो अपलोड करें (वैकल्पिक)
mr: छायाचित्र अपलोड करा (ऐच्छिक)

source: Enter description
hi: विवरण दर्ज करें
mr: वर्णन प्रविष्ट करा

source: Select violation type
hi: उल्लंघन प्रकार चुनें
mr: उल्लंघन प्रकार निवडा

# violation_submitted
source: Violation report submitted successfully
hi: उल्लंघन रिपोर्ट सफलतापूर्वक सबमिट की गई
mr: उल्लंघन अहवाल यशस्वीरित्या सबमिट झाला

# police_login_title
source: Police Login with OTP
hi: पुलिस लॉगिन (OTP द्वारा)
mr: पोलीस OTP लॉगिन
