Repository: ChahatMutha/Traffic-Management-App
Catalog: lib/l10n/app_*.arb
Languages: hi, mr

# enter_phone
source: Enter your police phone number
hi: अपना पुलिस फ़ोन नंबर दर्ज करें
mr: आपला पोलीस फोन नंबर प्रविष्ट करा

source: Phone Number
hi: फ़ोन नंबर
mr: फोन नंबर

source: Send OTP
hi: OTP भेजें
mr: OTP पाठवा

source: OTP sent to
hi: OTP भेजा गया
mr: OTP पाठवला गेला

source: Enter OTP
hi: OTP दर्ज करें
mr: OTP प्रविष्ट करा

source: Verify & Continue
hi: सत्यापित करें और जारी रखें
mr: सत्यापित करा आणि पुढे जा

# resend_code_question
source: Didn’t receive the code?
hi: कोड प्राप्त नहीं हुआ?
mr: कोड मिळाला नाही?

source: Resend OTP
hi: OTP पुनः भेजें
mr: OTP पुन्हा पाठवा

# otp_sent_success
source: OTP sent successfully to
hi: OTP सफलतापूर्वक भेजा गया
mr: OTP यशस्वीरित्या पाठवला

# otp_failed
source: Failed to send OTP
hi: OTP भेजने में विफल
mr: OTP पाठवण्यात अयशस्वी

source: OTP verification failed
hi: OTP सत्यापन विफल
mr: OTP सत्यापन अयशस्वी

# otp_invalid
source: Invalid OTP, try again.
hi: अमान्य OTP, फिर प्रयास करें।
mr: अवैध OTP, पुन्हा प्रयत्न करा.

# otp_required
source: Enter a valid 6-digit OTP
hi: 6-अंकों का मान्य OTP दर्ज करें
mr: 6-अंकी वैध OTP प्रविष्ट करा

# otp_pending_approval
source: Your account is pending approval.
hi: आपका खाता अनुमोदन की प्रतीक्षा में है।
mr: आपले खाते मान्यतेची प्रतीक्षा करत आहे.

# otp_complete_registration
source: Please complete police registration.
hi: कृपया पुलिस पंजीकरण पूरा करें।
mr: कृपया पोलीस नोंदणी पूर्ण करा.

# otp_welcome
source: Welcome back, Officer!
hi: स्वागत है, अधिकारी!
mr: स्वागत आहे, अधिकारी!

# please_enter_phone
source: Please enter your phone number
hi: कृपया अपना फ़ोन नंबर दर्ज करें
mr: कृपया आपला फोन नंबर प्रविष्ट करा

# police_waiting_title
source: Awaiting Approval
hi: प्रमाणन की प्रतीक्षा
mr: मंजुरीची प्रतीक्षा

# police_waiting_message
source: Your account is pending approval by the admin. Please check back later.
hi: आपका खाता व्यवस्थापक द्वारा अनुमोदन की प्रतीक्षा कर रहा है। कृपया बाद में पुनः जाँच करें।
mr: आपले खाते प्रशासकाच्या मंजुरीसाठी प्रतीक्षेत आहे. कृपया नंतर पुन्हा तपासा.

# police_signup_title
source: Police Signup
hi: पुलिस पंजीकरण
mr: पोलीस नोंदणी

source: Police ID
hi: पुलिस आईडी
mr: पोलीस आयडी

source: Station Code
hi: स्टेशन कोड
mr: स्टेशन कोड

source: Submit & Continue
hi: सबमिट करें और आगे बढ़ें
mr: सबमिट करा आणि पुढे जा

# signup_error_required
source: All fields are required.
hi: सभी फ़ील्ड आवश्यक हैं।
mr: सर्व फील्ड आवश्यक आहेत.

# signup_error_session
source: Session expired. Please login again.
hi: सत्र समाप्त हो गया है। कृपया फिर से लॉगिन करें।
mr: सत्र कालबाह्य झाले आहे. कृपया पुन्हा लॉगिन करा.

# signup_error_failed
source: Signup failed
hi: पंजीकरण विफल
mr: नोंदणी अयशस्वी

# policeSignupTitle
source: Police Signup
hi: पुलिस साइनअप
mr: पोलीस साइनअप

source: Police ID
hi: पुलिस आईडी
mr: पोलीस आयडी

source: Station Code
hi: स्टेशन कोड
mr: स्टेशन कोड

source: Region
hi: क्षेत्र
mr: प्रदेश

source: Submit & Continue
hi: जमा करें और जारी रखें
mr: सबमिट करा व पुढे जा

# sessionExpired
source: Session expired. Please login again.
hi: सत्र समाप्त हो गया। कृपया फिर से लॉगिन करें।
mr: सत्र कालबाह्य झाले. कृपया पुन्हा लॉगिन करा.

source: Signup failed
hi: साइनअप विफल रहा
mr: साइनअप अयशस्वी

source: Hello, Officer
hi: नमस्ते, अधिकारी
mr: नमस्कार, अधिकारी

source: Good morning!
hi: शुभ प्रभात!
mr: शुभ सकाळ!

source: Good afternoon!
hi: शुभ अपराह्न!
mr: शुभ दुपार!

source: Good evening!
hi: शुभ संध्या!
mr: शुभ संध्या!

# what_todo
source: What would you like to do today?
hi: आज आप क्या करना चाहेंगे?
mr: आज तुम्ही काय करू इच्छिता?

source: Create Challan
hi: चालान बनाएं
mr: चलन तयार करा

source: Search Vehicle
hi: वाहन खोजें
mr: वाहन शोधा

source: All Challans
hi: सभी चालान
mr: सर्व चलन

source: Civil Report
hi: नागरिक रिपोर्ट
mr: नागरिक तक्रार

source: Tow & Clamp
hi: टो और क्लैम्प
mr: टो व क्लॅम्प

source: Awaiting Approval
hi: अनुमोदन की प्रतीक्षा
mr: मान्यता प्रतीक्षेत

# pending_approval_msg
source: Your account is pending approval by the admin. Please check back later.
hi: आपका खाता प्रशासक द्वारा अनुमोदन की प्रतीक्षा कर रहा है। कृपया बाद में पुनः प्रयास करें।
mr: तुमचे खाते प्रशासकाच्या मान्यतेसाठी प्रतीक्षेत आहे. कृपया नंतर पुन्हा तपासा.

# police_challans_title
source: My Issued Challans
hi: मेरे द्वारा जारी चालान
mr: माझ्याकडून जारी केलेले चलन

# status_unpaid
source: Unpaid
hi: बकाया
mr: बकाया

# status_paid
source: Paid
hi: भुगतान किया गया
mr: भरलेले

# status_cancelled
source: Cancelled
hi: रद्द किया गया
mr: रद्द केलेले

# fill_details
source: Fill the details below
hi: नीचे विवरण भरें
mr: खालील माहिती भरा

source: Reason / Offense
hi: कारण / अपराध
mr: कारण / गुन्हा

source: Location (autofilled)
hi: स्थान (स्वतः भरा गया)
mr: स्थान (स्वयंचलित भरलेले)

source: Upload Photo Proof
hi: फोटो प्रमाण अपलोड करें
mr: फोटो पुरावा अपलोड करा

source: Selected proof image:
hi: चयनित प्रमाण छवि:
mr: निवडलेला पुरावा फोटो:

source: Submit Challan
hi: चालान जमा करें
mr: चलन सबमिट करा

# location_disabled
source: Location services are disabled.
hi: स्थान सेवाएं अक्षम हैं।
mr: स्थान सेवा अक्षम आहेत.

# location_denied
source: Location permission denied.
hi: स्थान की अनुमति अस्वीकार की गई।
mr: स्थान परवानगी नाकारली आहे.

# location_denied_permanently
source: Location permission permanently denied.
hi: स्थान की अनुमति स्थायी रूप से अस्वीकार की गई है।
mr: स्थान परवानगी कायमस्वरूपी नाकारली आहे.

# fetch_location_error
source: Failed to fetch location
hi: स्थान प्राप्त करने में विफल
mr: स्थान मिळवण्यात अयशस्वी

# please_fill_fields
source: ⚠️ Please fill all fields.
hi: ⚠️ कृपया सब फ़ील्ड भरें।
mr: ⚠️ कृपया सर्व माहिती भरा.

# not_logged_in
source: ⚠️ You are not logged in.
hi: ⚠️ आप लॉग इन नहीं हैं।
mr: ⚠️ आपण लॉग इन केलेले नाही.

# vehicle_not_found
source: No verified vehicle found with this number
hi: इस नंबर का कोई सत्यापित वाहन नहीं मिला
mr: या नंबरसाठी सत्यापित वाहन सापडले नाही

# challan_created
source: ✅ Challan created successfully!
hi: ✅ चालान सफलतापूर्वक बनाया गया!
mr: ✅ चलन यशस्वीपणे तयार केले!

source: ❌ Error occurred
hi: ❌ त्रुटि
mr: ❌ त्रुटी

source: Destination
hi: गंतव्य
mr: गंतव्य

source: Penalty
hi: जुर्माना
mr: दंड

source: Towed
hi: टो किया गया
mr: टो केले

source: Clamped
hi: क्लैम्प किया गया
mr: क्लॅम्प केले

source: Released
hi: रिहा किया गया
mr: सोडले

source: Pick Image
hi: छवि चुनें
mr: छायाचित्र निवडा

source: No image selected.
hi: कोई छवि चयनित नहीं की गई।
mr: कोणतेही छायाचित्र निवडले नाही.

# fetch_location_failed
source: Failed to fetch location
hi: स्थान प्राप्त करने में विफल
mr: स्थान मिळवण्यात अयशस्वी

# fill_all_fields
source: Please fill all fields and select an image.
hi: कृपया सभी फ़ील्ड भरें और छवि चुनें।
mr: कृपया सर्व माहिती भरा आणि छायाचित्र निवडा.

# entry_added
source: Tow/Clamp entry added.
hi: टो/क्लैम्प प्रविष्टि जोड़ी गई।
mr: टो/क्लॅम्प नोंद यशस्वीरित्या जोडली.

source: Upload failed
hi: अपलोड विफल
mr: अपलोड अयशस्वी

# past_entries
source: Past Tow/Clamp Entries
hi: पिछली टो/क्लैम्प प्रविष्टियाँ
mr: मागील टो/क्लॅम्प नोंदी

source: No entries found.
hi: कोई प्रविष्टियाँ नहीं मिलीं।
mr: कोणतीही नोंद सापडली नाही.

source: Memo
hi: मेमो
mr: मेमो

# pending_approval_message
source: Your account is pending approval by the admin. Please check back later.
hi: आपका खाता व्यवस्थापक द्वारा अनुमोदन लंबित है। कृपया बाद में दोबारा जाँच करें।
mr: तुमचे खाते अ‍ॅडमिनकडून मंजुरीसाठी थांबले आहे. कृपया नंतर पुन्हा तपासा.

# admin_greeting_title
source: Hey! Admin
hi: नमस्ते! एडमिन
mr: नमस्कार! अ‍ॅडमिन

# admin_loading_greeting
source: Loading your greeting…
hi: आपका अभिवादन लोड हो रहा है…
mr: आपले अभिवादन लोड होत आहे…

# admin_good_morning
source: Good Morning
hi: सुप्रभात
mr: शुभ सकाळ

# admin_good_afternoon
source: Good Afternoon
hi: नमस्कार
mr: शुभ दुपार

# admin_good_evening
source: Good Evening
hi: शुभ संध्या
mr: शुभ संध्या

# menu_approve_vehicle
source: Approve Vehicle
hi: वाहन स्वीकृत करें
mr: वाहन मंजूर करा

# menu_manage_users
source: Manage Users
hi: यूज़र्स प्रबंधित करें
mr: वापरकर्ते व्यवस्थापित करा

# menu_all_challans
source: All Challans
hi: सभी चालान
mr: सर्व चालान

# menu_handle_grievances
source: Handle Grievances
hi: शिकायतें संभालें
mr: तक्रारी हाताळा

# menu_reported_violations
source: Reported Violations
hi: रिपोर्ट की गई उल्लंघनें
mr: नोंदवलेले नियमभंग

# menu_add_quiz
source: Add Quiz
hi: प्रश्नोत्तरी जोड़ें
mr: प्रश्नमंजुषा जोडा

# menu_manage_police
source: Manage Police
hi: पुलिस प्रबंधन
mr: पोलीस व्यवस्थापन

# menu_app_settings
source: App Settings
hi: ऐप सेटिंग्स
mr: अ‍ॅप सेटिंग्स

# menu_alert_traffic
source: Alert Traffic
hi: ट्रैफिक अलर्ट
mr: ट्रॅफिक अलर्ट

# menu_incident
source: Incident
hi: घटना
mr: घटना

# menu_report
source: Report
hi: रिपोर्ट
mr: अहवाल

# menu_grievance_challan
source: Grievance Challan
hi: शिकायत चालान
mr: तक्रार चालान

# menu_grievance_receipt
source: Grievance Receipt
hi: शिकायत रसीद
mr: तक्रार पावती

source: Vehicle Approvals
hi: वाहन अनुमोदन
mr: वाहन मंजुरी

# filter_pending
source: Pending
hi: लंबित
mr: प्रलंबित

# filter_approved
source: Approved
hi: स्वीकृत
mr: मंजूर

# filter_rejected
source: Rejected
hi: अस्वीकृत
mr: नाकारले

# label_vehicle_number
source: Number
hi: नंबर
mr: क्रमांक

# label_owner
source: Owner
hi: मालिक
mr: मालक

# label_vehicle_type
source: Type
hi: प्रकार
mr: प्रकार

# label_added_on
source: Added On
hi: जोड़ा गया
mr: जोडलेले

# button_view_rc
source: View RC Document
hi: आरसी दस्तावेज़ देखें
mr: आरसी दस्तऐवज पाहा

# button_approve
source: Approve
hi: स्वीकृत करें
mr: मंजूर करा

# button_reject
source: Reject
hi: अस्वीकृत करें
mr: नकारा

source: No vehicles found.
hi: कोई वाहन नहीं मिला।
mr: कोणतीही वाहने आढळली नाहीत.

# rc_open_error
source: Unable to open RC document
hi: आरसी दस्तावेज़ नहीं खोल सका
mr: आरसी दस्तऐवज उघडू शकलो नाही

# manage_police
source: Manage Police Officers
hi: पुलिस अधिकारियों का प्रबंधन करें
mr: पोलीस अधिकाऱ्यांचे व्यवस्थापन

# search_hint
source: Search by ID, station, or region
hi: आईडी, स्टेशन या क्षेत्र द्वारा खोजें
mr: वाहन किंवा मालक शोधा

source: Pending
hi: लंबित
mr: प्रलंबित

source: Approved
hi: स्वीकृत
mr: मंजूर

source: Rejected
hi: अस्वीकृत
mr: नकारले

source: Station
hi: स्टेशन
mr: स्टेशन

source: Applied On
hi: आवेदन की तिथि
mr: अर्जाची तारीख

source: Approve
hi: स्वीकृत करें
mr: मंजूर करा

source: Reject
hi: अस्वीकृत करें
mr: नाकाराः

# no_officers
source: No police officers found.
hi: कोई पुलिस अधिकारी नहीं मिले।
mr: कोणतेही पोलीस अधिकारी सापडले नाहीत.

source: All Reported Violations
hi: सभी रिपोर्ट की गई उल्लंघन
mr: सर्व अहवालित उल्लंघने

# no_violations
source: No violations reported yet.
hi: अभी तक कोई उल्लंघन रिपोर्ट नहीं किया गया है।
mr: अद्याप कोणतेही उल्लंघन अहवालित नाहीत.

source: Date
hi: तारीख
mr: तारीख

source: Image
hi: छवि
mr: प्रतिमा

source: Manage Notices
hi: नोटिस प्रबंधन करें
mr: सूचना व्यवस्थापन

source: Add Public Notice
hi: सार्वजनिक सूचना जोड़ें
mr: सार्वजनिक सूचना जोडा

source: My Notices
hi: मेरे नोटिस
mr: माझ्या सूचना

source: Title
hi: शीर्षक
mr: शीर्षक

# enter_title
source: Enter a title
hi: एक शीर्षक दर्ज करें
mr: शीर्षक प्रविष्ट करा

source: Pick Photo
hi: फोटो चुनें
mr: फोटो निवडा

source: Post Notice
hi: नोटिस पोस्ट करें
mr: सूचना पोस्ट करा

# notice_added
source: ✅ Public Notice Added
hi: ✅ सार्वजनिक सूचना जोड़ी गई
mr: ✅ सार्वजनिक सूचना जोडली गेली

source: 🗑️ Notice Deleted
hi: 🗑️ सूचना हटाई गई
mr: 🗑️ सूचना हटवली गेली

source: Delete Notice
hi: सूचना हटाएं
mr: सूचना हटवा

# delete_notice_confirm
source: Are you sure you want to delete this notice?
hi: क्या आप वाकई इस सूचना को हटाना चाहते हैं?
mr: आपण ही सूचना हटवू इच्छिता का?

source: Delete
hi: हटाएं
mr: हटवा

# no_my_notices
source: No notices posted by you yet
hi: आपने अभी तक कोई सूचना पोस्ट नहीं की है
mr: आपण अद्याप कोणतीही सूचना पोस्ट केलेली नाही

source: Could not open image
hi: छवि खोलने में विफल
mr: प्रतिमा उघडता आली नाही

source: Reported Incidents
hi: रिपोर्ट की गई घटनाएं
mr: अहवाल दिलेल्या घटना

# no_incidents
source: No incidents reported.
hi: कोई घटनाएं रिपोर्ट नहीं की गईं।
mr: अद्याप कोणतीही घटना अहवालित नाही.

source: Incident Type
hi: घटना प्रकार
mr: घटनेचा प्रकार

source: Vehicle Type
hi: वाहन प्रकार
mr: वाहन प्रकार

source: Issued By
hi: जारीकर्ता
mr: जारी करणारा

source: All
hi: सभी
mr: सर्व

source: Admin Quiz Upload
hi: एडमिन क्विज अपलोड
mr: प्रशासक क्विझ अपलोड

source: Add Quiz
hi: क्विज जोड़ें
mr: क्विझ जोडा

source: Question
hi: प्रश्न
mr: प्रश्न

source: Option
hi: विकल्प
mr: पर्याय

source: Correct: Option
hi: सही: विकल्प
mr: योग्य: पर्याय

source: Select Image
hi: चित्र चुनें
mr: प्रतिमा निवडा

# no_quizzes
source: No quizzes found
hi: कोई क्विज़ नहीं मिला
mr: कोणतीही क्विझ आढळली नाही

source: Answer
hi: उत्तर
mr: उत्तर

source: No question
hi: कोई प्रश्न नहीं
mr: प्रश्न उपलब्ध नाही

source: Image not supported
hi: चित्र समर्थित नहीं है
mr: प्रतिमा समर्थित नाही

source: Traffic Alerts
hi: यातायात अलर्ट
mr: वाहतूक अलर्ट

source: Alert Type
hi: अलर्ट प्रकार
mr: अलर्ट प्रकार

# pick_datetime
source: Pick Alert Date & Time
hi: अलर्ट दिनांक और समय चुनें
mr: अलर्ट दिनांक व वेळ निवडा

source: Submit Alert
hi: अलर्ट सबमिट करें
mr: अलर्ट सबमिट करा

source: Alert Created!
hi: अलर्ट बनाया गया!
mr: अलर्ट तयार झाला!

# no_alerts
source: No alerts created yet.
hi: अभी तक कोई अलर्ट नहीं बनाया गया।
mr: अद्याप कोणतेही अलर्ट तयार झालेले नाहीत.

source: Time
hi: समय
mr: वेळ

# admin_receipts_title
source: Admin - Grievance Receipts
hi: प्रशासक - शिकायत रसीदें
mr: प्रशासक - तक्रार पावत्या

# admin_challans_title
source: Admin - Grievance Challans
hi: प्रशासक - शिकायत चालान
mr: प्रशासक - तक्रार चालान

source: User ID
hi: यूज़र आईडी
mr: वापरकर्ता आयडी

source: Submitted
hi: जमा किया गया
mr: सबमिट केले

# menu_report_incident
source: Report Incident
mr: घटना अहवाल
